# Qingxiang Guo
# {2022/5/22} {22:33}
#案例要求，使用列表储存豆瓣top250排行，使用列表存储电影信息
#要求输入演员名字，在屏幕上显示该演员出演了哪部电影
lst=[{'rating':[9.7,2062397],'id':'1292052','type':['犯罪','剧情'],'title':'肖申克的救赎','actors':['提姆罗宾斯','摩根弗里曼']},{'rating':[9.6,1528760],'id':'1291546','type':['剧情','爱情'],'title':'霸王别姬','actors':['张国荣','张丰毅','巩俐','葛优']},{'rating':[9.5,1559181],'id':'1292720','type':['剧情','爱情'],'title':'阿甘正传','actors':['汤姆汉克斯','罗宾怀特']}]
#这个列表里面是有三个字典组成，每个字典里面的值有的还有列表

name=input('请输入你要查询的演员:')
for item in lst:   #不同item是三个大字典
    if name in item['actors']:   #一个个的字典遍历，然后根据键actors获得，值：演员名字的列表，判断输入是否在列表里面
        print(name,'出演了',item['title'])  #如果在，打印电影名称

#输入提姆罗宾斯
# #显示提姆罗宾斯 出演了 肖申克的救赎